In [1]:
import pandas as pd

In [3]:
df=pd.read_csv(r"D:\sujal class\files\admission_data.csv")

In [4]:
df.head()

,GRE Score,TOEFL Score,University Rating,SOP,LOR,CGPA,Research,Chance_of_ Admit
0,337,118,4,4.5,4.5,9.65,1,0.92
1,324,107,4,4.0,4.5,8.87,1,0.76
2,316,104,3,3.0,3.5,8.00,1,0.72
3,322,110,3,3.5,2.5,8.67,1,0.80
4,314,103,2,2.0,3.0,8.21,0,0.65

In [5]:
df.tail()

,GRE Score,TOEFL Score,University Rating,SOP,LOR,CGPA,Research,Chance_of_ Admit
495,332,108,5,4.5,4.0,9.02,1,0.87
496,337,117,5,5.0,5.0,9.87,1,0.96
497,330,120,5,4.5,5.0,9.56,1,0.93
498,312,103,4,4.0,5.0,8.43,0,0.73
499,327,113,4,4.5,4.5,9.04,0,0.84

In [7]:
df.shape

(500, 8)

In [9]:
df.isnull().sum()

GRE Score            0
TOEFL Score          0
University Rating    0
SOP                  0
LOR                  0
CGPA                 0
Research             0
Chance_of_ Admit     0
dtype: int64

In [10]:
df.describe()

,GRE Score,TOEFL Score,University Rating,SOP,LOR,CGPA,Research,Chance_of_ Admit
count,500.000000,500.000000,500.000000,500.000000,500.00000,500.000000,500.000000,500.00000
mean,316.472000,107.192000,3.114000,3.374000,3.48400,8.576440,0.560000,0.72174
std,11.295148,6.081868,1.143512,0.991004,0.92545,0.604813,0.496884,0.14114
min,290.000000,92.000000,1.000000,1.000000,1.00000,6.800000,0.000000,0.34000
25%,308.000000,103.000000,2.000000,2.500000,3.00000,8.127500,0.000000,0.63000
50%,317.000000,107.000000,3.000000,3.500000,3.50000,8.560000,1.000000,0.72000
75%,325.000000,112.000000,4.000000,4.000000,4.00000,9.040000,1.000000,0.82000
max,340.000000,120.000000,5.000000,5.000000,5.00000,9.920000,1.000000,0.97000

In [11]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 500 entries, 0 to 499
Data columns (total 8 columns):
 #   Column             Non-Null Count  Dtype
---  ------             --------------  -----
 0   GRE Score          500 non-null    int64
 1   TOEFL Score        500 non-null    int64
 2   University Rating  500 non-null    int64
 3   SOP                500 non-null    float64
 4   LOR                500 non-null    float64
 5   CGPA               500 non-null    float64
 6   Research           500 non-null    int64
 7   Chance_of_ Admit   500 non-null    float64
dtypes: float64(4), int64(4)
memory usage: 31.4 KB

In [12]:
df.loc[2]

GRE Score            316.00
TOEFL Score          104.00
University Rating      3.00
SOP                    3.00
LOR                    3.50
CGPA                   8.00
Research               1.00
Chance_of_ Admit       0.72
Name: 2, dtype: float64

In [13]:
df.loc[[4,6]]

,GRE Score,TOEFL Score,University Rating,SOP,LOR,CGPA,Research,Chance_of_ Admit
4,314,103,2,2.0,3.0,8.21,0,0.65
6,321,109,3,3.0,4.0,8.20,1,0.75

In [15]:
df.loc[2:10]

,GRE Score,TOEFL Score,University Rating,SOP,LOR,CGPA,Research,Chance_of_ Admit
2,316,104,3,3.0,3.5,8.00,1,0.72
3,322,110,3,3.5,2.5,8.67,1,0.80
4,314,103,2,2.0,3.0,8.21,0,0.65
5,330,115,5,4.5,3.0,9.34,1,0.90
6,321,109,3,3.0,4.0,8.20,1,0.75
7,308,101,2,3.0,4.0,7.90,0,0.68
8,302,102,1,2.0,1.5,8.00,0,0.50
9,323,108,3,3.5,3.0,8.60,0,0.45
10,325,106,3,3.5,4.0,8.40,1,0.52

In [16]:
df.loc[2:10:2]

,GRE Score,TOEFL Score,University Rating,SOP,LOR,CGPA,Research,Chance_of_ Admit
2,316,104,3,3.0,3.5,8.00,1,0.72
4,314,103,2,2.0,3.0,8.21,0,0.65
6,321,109,3,3.0,4.0,8.20,1,0.75
8,302,102,1,2.0,1.5,8.00,0,0.50
10,325,106,3,3.5,4.0,8.40,1,0.52

In [18]:
df.iloc[2:7,0:6]

   GRE Score  TOEFL Score  University Rating  SOP  LOR   CGPA
2        316          104                  3  3.0   3.5  8.00
3        322          110                  3  3.5   2.5  8.67
4        314          103                  2  2.0   3.0  8.21
5        330          115                  5  4.5   3.0  9.34
6        321          109                  3  3.0   4.0  8.20

In [19]:
df.dropna()

,GRE Score,TOEFL Score,University Rating,SOP,LOR,CGPA,Research,Chance_of_ Admit
0,337,118,4,4.5,4.5,9.65,1,0.92
1,324,107,4,4.0,4.5,8.87,1,0.76
2,316,104,3,3.0,3.5,8.00,1,0.72
3,322,110,3,3.5,2.5,8.67,1,0.80
4,314,103,2,2.0,3.0,8.21,0,0.65
...,...,...,...,...,...,...,...,...
495,332,108,5,4.5,4.0,9.02,1,0.87
496,337,117,5,5.0,5.0,9.87,1,0.96
497,330,120,5,4.5,5.0,9.56,1,0.93
498,312,103,4,4.0,5.0,8.43,0,0.73
499,327,113,4,4.5,4.5,9.04,0,0.84